import { Button, ScrollView, StyleSheet, View } from "react-native";
import Card from "../components/Card";
import { VARS } from "../styles/vars/variables";

const item = {
  title:
    "Альфа-Банк автоматизировал работу МФО c участниками закупок wdwdwwdwdwd",
  description:
    "Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....Альфа-Банк первым в России автоматизировал работу микрофинансовых организаций (МФО) c участниками закупок....",
  id: 1,
  date: "Tue, 13 Jul 2021",
};

export default function NewsPage() {
  // function a() {
  //   fetch("https://alfabank.ru/_/rss/_rss.html?subtype=1&category=2&city=21", {
  //     method: "GET",
  //     headers: {
  //       "Access-Control-Allow-Origin": "*",
  //       "Access-Control-Allow-Methods": "GET,PUT,PATCH,POST,DELETE",
  //       "Access-Control-Allow-Headers":
  //         "Origin, X-Requested-With, Content-Type, Accept",
  //       "Content-Type": "application/json; charset=UTF-8",
  //     },
  //   })
  //     .then((res) => {
  //       res.text().then((htmlTxt) => {
  //         var domParser = new DOMParser();
  //         let doc = domParser.parseFromString(htmlTxt, "text/html");
  //         console.log(doc.querySelector("item"));

  //         // var feedUrl = doc.querySelector('link[type="application/rss+xml"]').href
  //       });
  //     })
  //     .catch(() => console.error("Error in fetching the website"));
  //   // fetch("https://jsonplaceholder.typicode.com/todos/1", {
  //   //   method: "GET",
  //   //   headers: {
  //   //     "Access-Control-Allow-Origin": "*",
  //   //     "Access-Control-Allow-Methods": "GET,PUT,PATCH,POST,DELETE",
  //   //     "Access-Control-Allow-Headers":
  //   //       "Origin, X-Requested-With, Content-Type, Accept",
  //   //     "Content-Type": "application/json; charset=UTF-8",
  //   //   },
  //   // })
  //   //   .then(function (response) {
  //   //     console.log("a");
  //   //     console.log(response.json());
  //   //     var c = response.json();
  //   //     console.log("b");
  //   //   })
  //   //   .catch(function (error) {
  //   //     console.log(
  //   //       "There has been a problem with your fetch operation: " + error.message
  //   //     );
  //   //     // ADD THIS THROW error
  //   //     throw error;
  //   //   });
  // }

  return (
    <ScrollView style={styles.container}>
      <Card
        title={item.title}
        description={item.description}
        date={item.date}
        fullScreenMode={true}
        isFavourite={true}
        style={styles.cardContainer}
      />
      {/* <Button title="click" onPress={a} /> */}
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  container: {
    backgroundColor: VARS.COLORS.grayLight,
    paddingVertical: VARS.OFFSETS.default,
    paddingHorizontal: VARS.OFFSETS.default,
    flex: 1,
  },
  cardContainer: {
    marginBottom: VARS.OFFSETS.double,
  },
});
